/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   choose_op.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lrosalee <lrosalee@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/03/04 19:40:36 by lrosalee          #+#    #+#             */
/*   Updated: 2020/03/04 19:43:20 by lrosalee         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "./includes/push_swap.h"

/*
** size_b/size_a: изменяем в зависимости от выбора опции
** после применения нужного типа сортировки применяем визуализацию
*/

void 	take_stack_op(t_stack **a, t_stack **b, t_op *val, char *opt)
{

}
